[{"reviewText":[{"reviewText":"Photo by Kenji M."}],"url":"https://www.yelp.com/"},{"reviewText":[{"reviewText":"Best Pets Near London, London"},{"reviewText":"50a Earlham Street"},{"reviewText":"You can request an appointment from this business"},{"reviewText":"16 Wigmore Street"},{"reviewText":"85 Camden Road"},{"reviewText":"32-34 Devonshire Road"},{"reviewText":"62 Sewardstone Road"},{"reviewText":"308 Portobello Road"},{"reviewText":"81 Chapel Market"},{"reviewText":"74 York Road"},{"reviewText":"220 Bethnal Green Road"},{"reviewText":"345 Caledonian Road"}],"url":"https://www.yelp.co.uk/search?find_desc=Pets&find_loc=London"},{"reviewText":[{"reviewText":"226-228 Essex Road"},{"reviewText":"London N1 3AP"},{"reviewText":"Start your review of Canonbury Veterinary Practice"},{"reviewText":"Although this is not the closest vet to my place, I chose this vet since it was close to my mate I was adopting my new pup from. I figured we'd be by often enough for visits that it made sense, especially after hearing so much positive reviews for them in the area and discovering they have a user friendly website.I adopted a new puppy so the services I needed were basic - exam, shots - overall prevention stuff. The place was inviting. The workers were clearly animal people who fawned over my little man. Titan (my new puppy) got a clean bill of health and they discussed things to look out for based on breed. I also like that there is a pet store there with equipment, leashes, toys and so on. It sort of took the sting out of the vet visit- since Titan was able to peruse the toys and find a leash/collar that looked dashing on him. They also had lots of suggestion and information on pet training/socialization.It proved to be an all around good source for my new pet. I'm very happy with them"},{"reviewText":"On moving to the area and checking out the various veterinary options we concluded that this one looked clean and professional and had the best facilities when compared with the competition. It has since recently expanded further to add surgical capability.Our two cats were duly taken along for their first check-up, which kicked off with a talk on responsible pet ownership. It transpired that, having been taken in by the advertising and ready availability at the local supermarket, what we were feeding them was wholly unsuitable and basically junk food (eek, how shameful!). In addition we were giving them too much of it - cats should be treated like \"bonsai panthers\" and kept lean and keen. It was suggested we could try giving them a raw chicken wing as a treat on occasion (cooked bones were bad for them).Duly admonished we stocked up on the more wholesome and natural Lily's Kitchen and Meowing Heads cat food sold by the adjoining pet shop, and, to the cats' disgust, reduced their portion sizes. When presented with a raw chicken wing (an outdoors only treat!), clearly having become accustomed to the cat equivalent of burgers and chips, and being the least convincing bonsai panthers ever likely to be seen, the cats quickly abandoned it in favour of a snooze on the sofa whilst they waited for something more palatable to turn up in their bowls.On their second annual check-up we arrived slightly apprehensive that we had failed to instill in them any appetite for the lifestyle of a bonsai panther, but all was fine (well, they're still on the larger side but it's not that they're fat, they're just big boned. Honestly, it's the nature of the breed!)I feel confident that this Practice knows what it's doing and, should my cats require anything more than a check-up and booster vaccinations, would be very capable of delivering a high standard of treatment and care.The reception staff always seem cheerful and friendly and are happy to help if you're looking for something in particular in the pet shop side of things, which stocks a good selection of food and other pet paraphernalia. I can never resist picking up some kind of treat when doing the food shop, and have returned home with everything from scratching mats, feather toys, and even a cat sensory centre (don't ask)!"},{"reviewText":"I haven't actually used this vets myself, though it seems to be well regarded. What it does have is an excellent pet store. No live animals, but lots of useful and fabulous stuff. Prescription and fancy diets. Pet toys. Harnesses. Specialist cat litter. The sort of things that might be difficult to find in a standard pet store. The lines tend to be luxury and specialist, sometimes imported from the States. The prices aren't the cheapest, but quality is excellent. If there's something you've been looking for, or you want something a little special, this could be the place. Go in with no such ideas and you'll probably find something that suddenly becomes essential for your pet"},{"reviewText":"We have used Canonbury vet quite often since we got our dog. They offer a really friendly and professional service and I always feel that my pet is in safe hands. I think they have four vets working there but we mainly see the same two, who now know our dog quite well. Their phone is manned 24 hours so you can ring out of hours for advice, which is very reassuring. Canonbury Vet arranges puppy classes in the shop on Tuesday nights, so puppies who are not yet fully vaccinated can go and socialise with other little ones. This is great for people who do not have other dog friends to visit. There is a seperate pet shop in the same building and it has got everything you need from food to toys, bedding and treats!"},{"reviewText":"The vets here seem really good, very professional and capable. The service here has always been good and when you register, they give you a free check up and weighing as well as a 30 minute consultation on how to care for your pet. This was great for us as new puppy owners! It's quite expensive however, and they can be very slow in filling out and sending insurance forms. The puppy party on Tuesday evenings is great! Invaluable for socialising pups who can't yet go out and possibly the cutest thing ever!"},{"reviewText":"Nice clean vet. Fay is the best caring and professional vet. My first experience taking my Pomeranian was to get her nails clipped. The nurse checked her nails out and said they were actually fine but only a couple needed trimming so she did it and did not charge me. Very kind. The vet prices are not cheap but they are caring. Excellent choice of dog food and treats. They will text you to remind you of your appointments or when your order has come in."},{"reviewText":"I'm a dog owner and the vets there were recommended to me by other pet owners several days ago. I believe that if there is a problem, you can contact them without a hesitation and they will take care of your adored puppies, kittens etc. I'm happy that you can find and rely on such reliable specialists these days."},{"reviewText":"I have used this vet surgery a few times. Firstly, I found the initial service good, and friendly reception staff. The actual vets I saw, though, were a bit stand offish, and not very good at explaining what they thought the problem was with my pet, which I wasn't too impressed with. But they sorted out the problem alright, and the rates are alright compared to some other places. I just think they could have been a bit more accommodating to the pet owners and letting them know what's going on with the animals."},{"reviewText":"Very good vets you should bring your animal there"},{"reviewText":"The clinic is excellent and they take great care of Max, or Labrador. We make all his annually shots here and if there's something wrong with him, we take him here. The staff is gentle to the animals and knows what they're doing."}],"url":"https://www.yelp.co.uk/biz/canonbury-veterinary-practice-london?osq=vet"},{"reviewText":[{"reviewText":"Kenbury Street"},{"reviewText":"Camberwell"},{"reviewText":"London SE5 9BS"},{"reviewText":"With so few reviews, your opinion of The London Animal Hospital could be huge. Start your review today."},{"reviewText":"When you dog starts walking in circles and is acting odd, and you need to get a CT scan, and your vet refers you to this hospital, make sure you go.  In fact, if you are in the area, just go here.  Reasons:Incredible set upFantastic teamExpert advice (Thanks to the Vet who helped us Will Chandler)Honest feedbackKind careThis is excellence!"}],"url":"https://www.yelp.co.uk/biz/the-london-animal-hospital-london?osq=vet"},{"reviewText":[{"reviewText":"82-86 Spa Rd"},{"reviewText":"Bermondsey SE16 3QT"},{"reviewText":"With so few reviews, your opinion of The London Cat Clinic could be huge. Start your review today."},{"reviewText":"The London Cat Clinic is the most amazing Vets for cats! The team are amazing, so knowledgeable and the facilities are amazing. Such a calm place and all the staff clearly care about the cats and you the owner! I cannot recommend more highly."},{"reviewText":"Amazing place for cats! Our little Nikita has received excellent attention and care from being spayed to treatment for her colitis. Dr Campbell is very knowledgeable about cats and the team knows how to make them feel comfortable and relaxed. He follows up with patients to make sure everything goes well and that their issues are fully resolved. I and my kitten and extremely impressed with the quality of care and I trust him completely with my pets. This clinic is cats only so it is quiet and clean. Highly recommend it."}],"url":"https://www.yelp.co.uk/biz/the-london-cat-clinic-bermondsey?osq=vet"},{"reviewText":[{"reviewText":"86 York Street"},{"reviewText":"London W1H 1QS"},{"reviewText":"With so few reviews, your opinion of London Veterinary Clinic could be huge. Start your review today."},{"reviewText":"My dear cat, Minxy, had to be put to sleep due to an illness she developed recently. I have taken her to this practice for all 13 years of her life and have always found the staff friendly and accommodating. They even gave me a follow up call to see how I was coping a couple of days after the event which I really appreciated. I would highly recommend the London Vet Clinic and, should if I choose to own another pet at some point, I will definitely be going back there."},{"reviewText":"I recently moved here from NY and was dreading having to find a new vet. I walked by their office and saw a dachshund wandering around in the front, so I took that as a sign to book my sausage dog in for his annual check-up. It was easy to get an appointment, Dr. Fogle was friendly and knowledgeable, and the price was a lot more reasonable than I was expecting."}],"url":"https://www.yelp.co.uk/biz/london-veterinary-clinic-london-2?osq=vet"},{"reviewText":[{"reviewText":"Royal College Street"},{"reviewText":"London NW1 0TU"},{"reviewText":"With so few reviews, your opinion of Beaumont Animals Hospital could be huge. Start your review today."},{"reviewText":"Phew!Visiting the vet could have been a very stressful experience (especially as my kitten was terrified on the bus, and shaking with fear by the time we arrived!) However the folks at this vet were all brilliant. * They were friendly and helpful when I called to make an appointment* I called because this comes up in the wrong place on the yelp map (it's further down the road, by the post office) ...staff gave good directions* We got to see a trainee vet first...followed by a fully trained vet. Both were really great with stitch (my kitten) and answered all my questions* Moggy MOT went well. He is now defleaed, dewormed, vaccinated and declared a healthy kitty. Phew!* All the staff seemed to be animal lovers...and they all really loved my kitten. This maybe the main reason for my 5 star review(!) I wish receptionists at doctors/hospitals for humans could be half as friendly!!Oh...and this vet surgery gives a discount if your on benefits. :)(So even if you lost your job, you'd be able to take care of your pets)"},{"reviewText":"Brilliant staff and a good value vets (which is really hard to find in North London!) I went for an emergency appointment. Phoned first thing and was in and out by 10:20am. They have both vet and nurse consults (nurse consults are a bit cheaper and great if its not quite a vet issue)."}],"url":"https://www.yelp.co.uk/biz/beaumont-animals-hospital-london?osq=vet"},{"reviewText":[{"reviewText":"151-153 Barking Road"},{"reviewText":"London E16 4HQ"},{"reviewText":"Start your review of Celia Hammond Animal Trust"},{"reviewText":"All I can say is thank you very much Celia for starting this charity. It has helped restore my faith in humanity.Her charity is mainly focused on cats and dogs, and especially rehoming stray cats. It is a vet aimed at helping those on low income or benefits, just anyone who cannot pay the extortionate vet bills that private vets charge.I am a rabbit owner and my mini-lop \"Blueberry\" broke her leg last year. I took her to the local Pets at Home vet called \"Companion Care\" and they were the worst type of people you could ever meet. They told me that the leg could not be fixed and must be amputated without so much as an X-Ray! This is on top of their initial demand that we pay them £500 for surgery!I was not convinced by the vet who spoke to me on the phone at Pets at Home, and so I looked around my area for another vet and found CHAT. I called them up, explained my situation and gave them the details of the current vet. The vet from CHAT called me up the same day, told me I should bring the bunny over to them, and then their vet called me on the phone and explained to me in detail what choices I have after examining my bunny, and it was very detailed and an informed discussion.Blueberry got through surgery, had a pin put in, and is now recovered. I have been back a few times to neuter my other rabbits, and to bring my thanks in the form of baking a cake for their staff.Their vets really do care about animals from the heart, and they are not here for profit (yes they are a charity!!) They do charge for their services but the cost is considerably lower than private vets. I have met Celia herself and she is an old but seriously dedicated lady. I have been to the charity as late as 11pm and there are still a lot of staff working here taking care of animals.I have been doing 10k runs to raise funds for CHAT and if your pets need help and you can't afford private vet care, your pet cannot be in better hands than Celia's charity."},{"reviewText":"A truly inspiring place, led by a truly inspiring woman! Celia Hammond's rescue centres do fantastic work with abandoned and rescued cats from all over London and for those looking to adopt a pet, the trust is an excellent port of call. I recently adopted two cats from the Canning Town branch, and our new pets were vaccinated and handed over by Celia herself. I was amazed by how hands-on she is with the animals, and is clearly hugely dedicated to her work. The cats were treated with huge amounts of love and care before being given to us, and had had all the appropriate treatments carried out. I only wish I could have taken more! :("},{"reviewText":"I would like to thank to everyone at Celia Hammond for taking care of our beloved Bonnie. She passed away two months ago at the age of 21. She had chronic kidney disease, I was informed that it's common for elderly cats and it was only a matter of time. They took great care of Bonnie and would go extra lengths to ensure she was getting the best treatment. Celia Hammond goes above and beyond in taking care of our beloved animals."},{"reviewText":"This is an excellent charity - it's the responsibility of the rest of us to make sure they are not overloaded with these beautiful animals - unbelievable the things we humans do to them! I give regularly to them ... not a fortune ... but a regular sum every month and the more people who do the same the more they can keep their heads above water. Taking in stray cats, dogs or whatever pet should be such an unusual event and homes would therefore be found for the few unfortunate animals thus affording them the life they more than deserve. The programme was hard to watch and being such an admirer and lover of animals i would normally not watch for the sake of my own sanity! BUT i did force myself to watch ... what brave souls they all are to day after day give their time in this way .... I salute them for the hard/good work they do! Lin H"},{"reviewText":"celia hammonds is situated on the ever so busy barking road, canning town. Public transport-Nearest train station-canning town(10minutes walk)Buses- Many buses pass through here and you can catch a bus from loads of places. Celia hammonds a bit of history-Celia hammond was a model in the 1960's she later became concerned about the cruelty of the fur trade and took a stand against fur. In 1986 she founded the celia hammond animal trust which she wanted to open up as a low cost neuturing clinic. In 1999 this(canning town) was the third neuturing clinic she opened and now she takes in stray animals,rescues and rehomes the animals. In 2006 there was news of celia hammond owing thousands of pounds to newham council over unpaid parking fines as she was parking on double yellow lines outside of the shop to get sick animals quickly into her shop to get tretment. What celia hammonds trust does-Treat animals that have been kicked out of their homes, treated badly and for those animals that need to be neutured or for those who have an accident. This place does an excellent job for these sick animals and if it was to go t would be sadly missed. This shop also holds alot of sick animals which need new homes. This is a fantastic place and it needs more money to be given to it, to continue oing the fantastic job it does. I have realised since this happened in 2006 this celia hammonds doesnt do as much as they used to do to help if your pet is sick."}],"url":"https://www.yelp.co.uk/biz/celia-hammond-animal-trust-london-2?osq=vet"},{"reviewText":[{"reviewText":"94 Dawes Road"},{"reviewText":"Fulham"},{"reviewText":"London SW6 7EJ"},{"reviewText":"With so few reviews, your opinion of Paws Inc Veterinary Clinic could be huge. Start your review today."},{"reviewText":"The vets and nurses at Paws inc. have been looking after my cats for almost 15 year now. The staff at the practice are all equally professional, knowledgeable, friendly and compassionate - I trust them entirely and would recommend them without hesitation."},{"reviewText":"£10 off your first consultation"}],"url":"https://www.yelp.co.uk/biz/paws-inc-veterinary-clinic-london?osq=vet"},{"reviewText":[{"reviewText":"Sonderburg Rd"},{"reviewText":"Finsbury Park"},{"reviewText":"London N7"},{"reviewText":"With so few reviews, your opinion of RSPCA could be huge. Start your review today."},{"reviewText":"Rating this place is a difficult task. I've given it a rating as a vets, but that is unfair to its staff who do an amazing job. On the negative side it's not somewhere you really want to be. For a start there's no appointments, so you have to queue, usually for at least a couple of hours. Once you do get called you get to see whatever vet is available, and there's a lot of different vets. There's no chance to build up a relationship with one. It's a bit of a conveyor belt. An example: one vet lets you hold your cat for blood tests, others will insist on getting a nurse in or even sending them into the back. Annoying as I'm well able to hold them and it's better for them if I do. Also, it's no frills treatment. Of course, it is a clinic for people on a low income, so avoiding unnecessary expense is needed. But as someone who's read up on their cat's conditions, I know I'm not getting some of the tests etc that might be available if I was able to afford a private vet. And of course, though most folks and animals there are nice, you do get to share a waiting room for hours with some you'd rather not. Days when badly trained dogs all start barking at each other are not pleasant. I have to give five stars to the staff though. Some of them (naming no names) have been know to be a bit jobsworth, but with some of the folks that come in taking the proverbial (i.e. want free treatment for the dog because they want to buy the newest mobile or something) I can't really blame them. My cats have always been calm there, and while I give myself some credit for that, I think it also shows that the vets have a good attitude. I also feel happy if my cats have to go in for an operation: unlike some small vets they have staff on duty 24 hours. By the way it's not free, you pay a £10 consultation fee plus medical costs. As an example a few years ago dentals for my cats cost £150 each at a private vets, and a couple of years later £40 at the Harmsworth. And yes, it is the place that featured in 'Animal Hospital' with Rolf Harris. It is kind of cool to be able to say your cat has been seen by a celebrity vet, but it's not worth it. If you have the money, you should go to a private vet, to avoid your animal waiting around for hours if nothing else. Most of the ones off the telly seem to have moved on now anyway"},{"reviewText":"I can't believe the grumblers. This organisation is charitable and relies on donations. If you are there then it's because you are in need of financial help, and as far as I'm concerned you therefore have no right to grumble  every penny spent is spent as wisely as possible so that they can cover a larger number of animals. Expecting premium care and attention means you may be depriving another animal in crisis with the care it needs. Targeting staff with your frustration is also unfair  they work long hours and have to deal with very many bad-tempered clients or lonely people wanting to chat. Their priority is the animals and that, as far as I'm concerned, is the right way for it to be. I've used the Harmsworth twice in an emergency and I think they do a fantastic job with the little they are given. Really fantastic.Next time you are frustrated by a long wait or lack of a smile from someone  understand that it's because of the huge volume of demands that are made on the hospital and maybe make a small donation to help out, on top of your fee, that's what we did. Just £5 or £10 but it's a nod to the idea that you shouldn't take on a pet then expect someone else to provide it's healthcare at low cost for the whole of its life. It's an emergency service, not the vet at the corner of the road. So keep your expectations more realistic and be a little more generous with the people who work there, please. It upsets me that they are being targeted when it's a charity and they are doing the best they can. Other vets have a huge mark up on their costs and they also make mistakes."},{"reviewText":"I feel I must stick up for this place based on my visit there.My 16 year old Norwegian Forest Cat had another bout of Cystitis so I had to take him here.The lovely young lady vet was most courteous and professional and I really couldn't ask for more care and expertise then was given.I actually think the care was better then the previous time he was ill and I took him to a private vet (I have since being reduced to part-time hours at my work so can no longer afford a private vet).I was even in and out in an hour,although I realize people aren't always this lucky.As previous posts have said it can be annoying in the waiting room when you get a 'canine chorus' but that is the price you have to pay for cheap treatment."},{"reviewText":"I have given them two stars for trying but the service is over used and frankly even abused by those on low incomes that have several Dogs.If your not working and cannot afford a Dog, don't get one period.But the same people supposedly on a Low income sneak outside and smoke like 20 cigarettes and drink lager while they wait the 3 or more hour wait! and many people are more sick looking than the several Dogs they bring with them.I sat next to a lady that clearly had a very severe scalp infection and smelled strongly of urine,but she had her lager and cigarettes!.The system was brought about for genuine animal lovers whom are in genuine temporary hardship but that system is clearly being abused.I'm on DLA benefits,but I would eat baked beans for a week to save myself going through what me and my pooch went through last time,so many huge and aggressive pit-balls snarling at my poor Bichon Frisein his little red coat! and some of the owners looked and had an attitude like their pit-balls believe me!.The poor very young vet was seriously overworked.(as there was only one)my dog was on the table for seconds and overall the medicines are not that cheap anyway that I would go through that again ever.Basically its just over 50% cheaper with 60% more stress than going to a private vet.I guess in life you get what you pay for,or don't want to pay for!..."}],"url":"https://www.yelp.co.uk/biz/rspca-london-10?osq=vet"},{"reviewText":[{"reviewText":"85 Lavender Hill"},{"reviewText":"London SW11 5QL"},{"reviewText":"With so few reviews, your opinion of All Creatures Veterinary Surgery could be huge. Start your review today."},{"reviewText":"Spending Friday night intently watching your cat to see how much of a problem he has peeing, instead of going out to eat ramen with other Yelpers, doesn't sound like a great choice of activity. However, being a responsible pet owner, that is the choice I made (and the poor cat was looking so mournful, I had to forgive him his inconvenient timing).I phoned All Creatures just before closing time and explained little Alfie's odder than usual behaviour and obsessive toileting needs. The lady I spoke to was immediately helpful, seemed genuinely concerned and quickly advised on the possible medical explanation. I was able to book an appointment for first thing the following morning and she also gave me the number for the emergency out-of-hours vet just in case.The next morning, (having phoned the emergency vet and been given some very clear guidance enabling me to assess that the situation wasn't imminently fatal - I have so much knowledge on the topic now I feel like I may be capable of achieving a minor veterinary qualification myself), Alfie and I duly pitched up at All Creatures. The vet we saw came across as caring and knowledgeable, and Alfie seemed pretty calm throughout despite ordinarily being susceptible to stress during close encounters with vets. He even didn't seem to mind the observations about his weight - he's on a diet and going cold turkey on \"Dreamies\", but no need to rub it in when a fella's already feeling delicate eh. As well as dealing with the medical issue in hand, the vet also gave Alfie a general check, which seemed very thorough, noticing that he needs some dental work for a cracked tooth (which might have something to do with his penchant for tearing cardboard boxes into bits with his teeth). So it looks like we'll be returning quite soon."},{"reviewText":"This is a great veterinary surgery.When I lived in Wandsworth Town, I elected to take my two rats to this vet, as it was a nearby surgery that specialised in exotics (in addition to the normal cats, dogs and rabbits of course). The vets and the technicians were always friendly and knowledgeable. I had to take one of my rats in for surgery twice (to get tumours removed), and she was treated like a celebrity at All Creatures (one of the vet nurses particularly fawned all over her when she was in recovery and looked forward to when she had to come in for follow-up appointments so she could have a cuddle).The facilities themselves are completely clean, and - importantly for wary animals - All Creatures doesn't SMELL like a vet.I moved away from SW London and decided I should start taking my rats to a closer vet surgery, so I did. However, usually chilled out pets, they did not like this new vet, not even on their second visit, not one bit. So the next time they needed treatment I decided to take them back to All Creatures. My rats were most at ease with their most recent visit. So much so that there's no where else I can possibly ever take them, even if it might be a little more convenient for me.All Creatures is a winner."}],"url":"https://www.yelp.co.uk/biz/all-creatures-veterinary-surgery-london?osq=vet"},{"reviewText":[{"reviewText":"150 Corfield Street"},{"reviewText":"London"},{"reviewText":"London E2 0DS"},{"reviewText":"With so few reviews, your opinion of Home Vets London could be huge. Start your review today."},{"reviewText":"Home Vets London came to the rescue when I needed a last minute Animal Health Certificate to relocate from UK to EU because my regular vet informed me that they weren't going to be able to do it. Nuria was the first person I got in contact with and she was extremely kind, friendly, and always answered my questions in a timely manner throughout the entire process. Dr. Jose was the one to physically come to our house and not only was he also extremely kind, but my dogs absolutely loved him (and they usually are petrified of vets). He got on the floor to play with my dogs and gain their trust before doing any work. Dr. Cesar  became like a friend throughout the entire process. I had a different case because my rabies and all my documentation came from the USA originally; however,  there was an issue with the paperwork from the original USA vet. Dr. Cesar worked with me even during the weekend to help get this issue resolved with my original vet in order for my dogs to be able to travel. I was such a nervous wreck but Dr. Cesar did everything in his power and thanks to him and his team we are all now in the EU in our new home.I have absolutely nothing negative to say about this team. They were amazing from the very first email all the way to the follow up from them to make sure we got to our new home safely. I only wish I had met them when we first arrived in London as I would have loved for them to have been our vet from the very beginning. Thank you so much to the entire Home Vets London team!!"}],"url":"https://www.yelp.co.uk/biz/home-vets-london-london?osq=vet"},{"reviewText":[{"reviewText":"Photo by Trung N."}],"url":"https://www.yelp.com/"},{"reviewText":[{"reviewText":"Best Pets Near London, London"},{"reviewText":"50a Earlham Street"},{"reviewText":"You can request an appointment from this business"},{"reviewText":"16 Wigmore Street"},{"reviewText":"85 Camden Road"},{"reviewText":"32-34 Devonshire Road"},{"reviewText":"62 Sewardstone Road"},{"reviewText":"308 Portobello Road"},{"reviewText":"81 Chapel Market"},{"reviewText":"74 York Road"},{"reviewText":"220 Bethnal Green Road"},{"reviewText":"345 Caledonian Road"}],"url":"https://www.yelp.co.uk/search?find_desc=Pets&find_loc=London"},{"reviewText":[{"reviewText":"52 Amwell Street"},{"reviewText":"London EC1R 1XS"},{"reviewText":"Start your review of Amwell Veterinary Surgery"},{"reviewText":"So far, so good... I found this veterinary practice on Yelp based on an older review, and hoped that all the facts still rung true. My luck (and Tillie's!) they certainly did. My pup is getting on in years, and that comes with its own set of challenges. I wanted to have her throughly checked out to make sure nothing was terribly amiss before we left on a long trip. I easily and quickly made an appointment with the very polite receptionist and was booked in for a Friday evening appointment. We arrived rain-soaked to a happy, warm office full of the vet's own pooches. We were greeted warmly, seen quickly and the good doctor gave her a once over and sent me home with instructions to collect a urine sample (I had my husband do that job, thankyouverymuch) and return the following day to have it tested for any irregularities, etc. Dutiful dog dad did just this, walked it back over, paid £20 for the test, and they called us later that day with the results: your dog is old and her kidneys are slow, but she isn't in any pain or distress. Well, all good...best case scenario and we now take many trips outside to use \"the loo\" to accommodate the kidney-deficient canine. Big plus: the initial exam and registration appointment is free of charge. I had no idea this was true...but what a great way to be introduced to a practice. I'll surely be back. Very friendly folks that won't try to upsell you and leave you bankrupt. Practical solutions for your pets."},{"reviewText":"Today was Dexter's first visit to Amwell. The purpose of the visit was to get a refill of Loxicom and since we are new to the area and to the surgery, the vet wanted to check Dex out. No problemo.Our visit was free; all new patients are given a free consultation. So, that's awesome.Both the woman running \"front of house\" and the vet were super nice and smiley. I learned that the surgery is a one-man show which means the vet works a ton of hours! The surgery is super clean. Like super duper clean.His bedside manner was awesome. Dexter is generally not a huge fan of vet surgeries but he was more relaxed here than at any other vet surgery in the England. Perhaps this was because - since it is a one-man show - there were no other pets in the surgery waiting room, making him anxious. Perhaps it was because the examination room is twice the size of any examination room I've seen in England so he didn't feel boxed in. I don't know the reason. All I know is that Dexter was calm and wasn't trying to crawl under the table and that was nice.All of the above is great but the best thing about this surgery is the vet himself. Dex is an old chap. At 15.25, he's got his share of issues (arthritis, carpal hyperextension, poor eyesight, lumps, grumpiness) and our prior vet would always push us to do tests on his lumps or require that he do bloodwork to ensure Dexter's liver was handling his pain medications. I never agreed with this approach because Dexter is 15 years old. 15! There is no reason to run tests on his lumps because my husband and I have decided that we will take no action on said lumps. Why? Because he's 15. He is four years beyond the average max lifespan for his breed. This would be like giving a 100 year old human chemotherapy. I mean, that sounds a bit silly, right?Anyway, this vet shares our thoughts on tests and treatments and never once pressured me to run tests and that was the most wonderful thing ever. He respects our standpoint and since he never suggested running tests, I never felt guilty about being a bad human for not \"running every test imaginable to make sure my dog is absolutely taken care of and we know every single detail about his hemoglobin.\" I wish all vets were like this!"},{"reviewText":"Been using amwell for a few months now, they have been very helpful, Dr dale have always been helpful for issues of my dog, Margaret is also very knowledgable about immigration and general health issues. I lived with my dog I three different countries, amwell is hands down the best vet I have been"},{"reviewText":"The folks running the show here are incredibly professional and full of love for animals. They were so kind when helping us cope with the loss of a family pet and have been incredibly helpful now that we have a new set of kittens. We chose them because their office is close to our flat, but even if I lived in another part of London, I strongly consider keeping them as our vets."},{"reviewText":"Such a friendly veterinary surgery . The owner himself is welcoming and very caring. Takes his time and offers great advice.Would also recommend the puppy training classes they offer through their surgery"}],"url":"https://www.yelp.co.uk/biz/amwell-veterinary-surgery-london?osq=vet"},{"reviewText":[{"reviewText":"52 Abbeville Road"},{"reviewText":"London SW4 9NF"},{"reviewText":"With so few reviews, your opinion of David Cuffe & Associates could be huge. Start your review today."},{"reviewText":"Very friendly and helpful staff!Would recommend this vet to anyone. Opening hours are very convenient - open to 7.30pm most evenings.Quite pricey though."},{"reviewText":"Very happy with them, everyone in the area recommended them to me when I moved down. Not cheap but for a Vet open on Sundays Very pleased."}],"url":"https://www.yelp.co.uk/biz/david-cuffe-and-associates-london-3?osq=vet"},{"reviewText":[{"reviewText":"233-235 Lewisham Way"},{"reviewText":"Lewisham"},{"reviewText":"London SE4 1UY"},{"reviewText":"With so few reviews, your opinion of Celia Hammond Animal Trust could be huge. Start your review today."},{"reviewText":"The ordeal the these people put my family and me through during the end of our cats life was utterly disgusting! After finding out from our regular vet that our beloved pet was sick with an unidentified mass in his abdomen we were referred to the Celia Hammond trust for a scan and potential operation. These people must have magic hands and some top notch clairvoyance , because not only did they not do the scan we asked for to identify how large and how many masses we were later told were tumors there were, but somehow they were able to tell my younger brother that our cat was not only leukemia free, but lymphoma free as well. These people cut open our cat BLIND, had a quick look about, and then discarded the mass that they could see WITHOUT testing it (the ONLY way to clear the lymph nodes for cancer). THIS WAS NOT IN THERE POLICY TO DO.  When I came back to our regular vet for his post op check up, I was horrified to be informed that they had helped themselves to our money but only did half a job. What right did you people have to make us think for a short 4 weeks that we were in the clear??? They had told us that the operation was a success and gave no indication that if he survived there would be further implications. according to them an over the phone check up 3 days later was enough to make sure he was well. without testing the mass they removed these people were unqualified to tell us everything would be alright! you sold the youngest in my family a dream and now we have had to bury our family pet! had you people done your job, I can't say we would have had a different outcome but we may have been more emotionally prepared to handle needing to put him down. One thing I NEVER imagined I would have to see in my lifetime is the look on my younger brothers face as his heart broke, and the negligence of how this case was handled HEAVILY contributed to me witnessing just that. BUT IT DID NOT STOP THERE!!!obviously after finding NEW TUMORS in our cat a mere 4 weeks after his operation we wanted answers, to know our options, and to know how much time we had left and if we could prolong his life. My mother and I decided we would make another follow up appointment at Celia Hammond for them to physically examine him. I hope the person in charge of the staffing for this foundation is ASHAMED of themselves because what we were met with was a disgusting veterinarian uninterested with doing her job. EVE TSOMPANIDOU IS NOT FIT TO BE IN A JOB ROLE THAT INVOLVES INTERACTING WITH PEOPLE!! after waiting half an hour for our appointment with my heart in my throat we are finally seen and as you would expect she asked how we were. Let me make clear, most people treat a vet like they do their doctor, you are there when something is wrong, we were also very confused as to why the tumors were back when we were told the operation was a success and the chance that they could come back was not at all discussed. my mum very politely replied that we wouldn't really be able to answer that until after the questions we had were answered. The change in this womans attitude was so vile I thought I was going to be sick! she immediately crossed her arms and took a step back from our cat! during the time it took to try and get clarity on what had and had not been done for our cat in his last visit I actually had to ASK her to examine him, during which she glared at me for an uncomfortably long time! She evaded questions she had the answers to as the notes were UP ON HER SCREEN, just in a short hand that no non vet would understand. She then very bluntly and coldly told us it was terminal. Not only was this the first time anyone had said this would be what could happen (if the operation went well) she seemed to know this without doing a proper examination.  This woman was not only vile towards me but had the AUDACITY to speak down to my mother then say she would break the news to my brother OVER THE PHONE THAT HIS CAT WOULD DIE! ARE YOU INSANE!? People should shell out the extra money to go ANYWHERE else if they love their pets!"},{"reviewText":"They are without a doubt the most caring people I have ever met.  I am so so pleased with the treatment and care they have given my dog. I thought they only cared for cats, but no they cared for my little dog when she was very ill.  Keep up the good work."},{"reviewText":"In the 1960's Celia Hammond was a supermodel. During her career she did model fur but then became concerned about animal welfare and cruelty. She decided to set up the Celia Hammond Trust initially because of her concerns over the feral cat population. She became involved in rescuing, neutering and rehoming stray and unwanted animals. She learned how to trap feral cats and started to trap, neuter and return to suitable sites many thousands of feral cats. She then decided to open clinics - and I believe this one in Lewisham was the first - in order to provide a neutering and vaccination service for pet owners who could not afford the exorbitant prices some vets charge. Without her clinic many owners would not be able to afford to have their pet neutered which would result in many many more unwanted animals. Recently she was involved in rescuing 186 cats from the olympic site in London. She personally spent hours then trying to catch all the cats. One in particular eluded her but with the deadline reached she managed to catch him. They were all neutered and most of them have been found new homes. I think she is a brilliant woman - a real animal lover and doing so much good."},{"reviewText":"celia hammond u rock and keep up the good work!"}],"url":"https://www.yelp.co.uk/biz/celia-hammond-animal-trust-london?osq=vet"},{"reviewText":[{"reviewText":"7 Addison Avenue"},{"reviewText":"London W11 4QS"},{"reviewText":"With so few reviews, your opinion of The Holland Park & Addison Veterinary Clinic could be huge. Start your review today."},{"reviewText":"This is a lovely old-fashioned vet's surgery, with an impressive photo of a lion above the counter and a fat black cat named Shadow on same who loves all the attention.It is located in one of the area's most beautiful roads and you feel like walking back in time for the duration of your visit.Dr Carmichael and his staff really care about the animals they treat (unlike some other vets I've been to who try and sell you unnecessary and expensive treatments ) and make you, and most importantly your pet, feel at ease.Special bonus: you can also buy some of the best olive oil here!"},{"reviewText":"Have been coming to Addison Veterinary Clinic for 8 years. The staff are friendly and kind, go out of their way to help and most importantly they are all very professional & trustworthy. Would recommend to anyone."}],"url":"https://www.yelp.co.uk/biz/the-holland-park-and-addison-veterinary-clinic-london?osq=vet"},{"reviewText":[{"reviewText":"Hyde Park Veterinary Centre"},{"reviewText":"61-63 Connaught Street"},{"reviewText":"London W2 2AE"}],"url":"https://www.yelp.co.uk/biz/hyde-park-veterinary-centre-london?osq=vet"},{"reviewText":[{"reviewText":"55 Elizabeth Street"},{"reviewText":"Victoria"},{"reviewText":"London SW1W 9PP"}],"url":"https://www.yelp.co.uk/biz/elizabeth-street-veterinary-clinic-and-emergency-service-london?osq=vet"},{"reviewText":[{"reviewText":"47 Burdett Road"},{"reviewText":"Bow E3 4TN"}],"url":"https://www.yelp.co.uk/biz/goddard-veterinary-group-bow-3?osq=vet"},{"reviewText":[{"reviewText":"85 Camden Road"},{"reviewText":"Camden"},{"reviewText":"London NW1 9EX"}],"url":"https://www.yelp.co.uk/biz/pets-at-home-london-london-2?osq=vet"},{"reviewText":[{"reviewText":"71 St Helens Gardens"},{"reviewText":"London W10 6LL"}],"url":"https://www.yelp.co.uk/biz/village-vet-london-33?osq=vet"},{"reviewText":[{"reviewText":"79 Grange Rd"},{"reviewText":"London SE1 3BW"}],"url":"https://www.yelp.co.uk/biz/andrew-h-kirby-london?osq=vet"}]